// Операція: 'number' + 3 + 3
// Оскільки серед аргументів є рядок, то при додаванні відбуваєється процес неявного перетворення всіх аргументів в рядок. В результаті відбувається конкатенація рядків: 'number' + 3 дає 'number3', а 'number3' + 3 = 'number33'
console.log('number' + 3 + 3);

// Операція: null + 3
// Коли до null додається число, null перетворюється на число 0: 0 + 3 = 3
console.log(null + 3);

// Операція: 5 && "qwerty"
// && перевіряє обидва операнди і повертає перший хибний операнд, або якщо всі операнди істинні, то повертає останнє істинне значення.
// Оскільки 5 - істинне значення (всі числа, окрім 0 є істинними), повертається "qwerty".
console.log(5 && "qwerty");

// Операція: +'40' + +'2' + "hillel"
// Оператор + при використанні з одиничним знаком перетворює рядок у число: +'40' дає 40, а +'2' дає 2. Але так як далі додаємо рядок, виконується конкатенація: 40 + 2 + "hillel" дає '42hillel'.
console.log(+'40' + +'2' + "hillel");

// Операція: '10' - 5 === 6
// Оператор '-' виконує арифметичну операцію, тому при використанні з рядком, JavaScript намагається перетворити рядок у число.
// '10' - 5 = 10 - 5 = 5
// Далі перевіряємо на рівність два числа, що не є істиною:
// 5 === 6 = false
console.log('10' - 5 === 6);

// Операція: true + false
// true і false перетворюються в числа 1 і 0 відповідно при використанні з оператором +
// Далі виконується операція додавання:
// 1 + 0 = 1
console.log(true + false);

// Операція: '4px' - 3
// Коли намагаємось виконати математичну операцію з рядком, який не є числом, як у випадку з '4px', JS намагається привести цей рядок до числа.
// '4px' не є числом, тому результатом буде NaN (Not-a-Number).
console.log('4px' - 3);

// Операція: '4' - 3
// Оператор '-' намагається перетворити рядок на число для виконання операції, потім виконується віднімання:
// '4' = 4
// 4 - 3 = 1
console.log('4' - 3);

// Операція: '6' + 3 ** 0
// Спочатку виконується піднесення до ступеню, потім виконується операція додавання
// 3 ** 0 = 1
// Аналогічно, результатом буде конкатенація рядків:
// '6' + 1 = '61'
console.log('6' + 3 ** 0);

// Операція: 12 / '6'
// Оператор / виконує арифметичну операцію, тому намагається привести рядок до числа.
// '6' = 6
// 12 / 6 = 2
console.log(12 / '6');

// Операція: '10' + (5 === 6)
// Спершу виконується операція порівняння в дужках, а потім конкатенація рядків:
// 5 === 6 = false
// '10' + false = '10false'
console.log('10' + (5 === 6));

// Операція: null == ''
// Оператор '==' виконує нестроге порівняння і намагається привести обидва значення до однакового типу.
// null не дорівнює '' (різні типи), тому результат - false
console.log(null == '');

// Операція: 3 ** (9 / 3)
//Спочатку виконуємо вираз в дужках, а потім підносимо до отриманого ступеняЖ
// 9 / 3 = 3
// 3 ** 3 = 27
console.log(3 ** (9 / 3));

// Операція: !!'false' == !!'true'
// Правило: !! використовується для перетворення значення в булевий тип
// 'false' і 'true' - обидва рядки є істинними:
// !!'false' -> true, !!'true' -> true
// true == true дає true
console.log(!!'false' == !!'true');

// Операція: 0 || '0' && 1
// && шукає перше хибне значення або останнє значення, якщо всі операнди істинні
// '0' && 1 дає 1 (останнє істинне значення, так як обдва істинні, бо у JavaScript всі непусті рядки (в тому числі і '0') вважаються істинними)
// || повертає перше істинне значення: 0 || 1 = 1 
console.log(0 || '0' && 1);

// Операція: (+null == false) < 1
// Спочатку виконується унарний плюс до null, що перетворює його в 0: 0 == false дає true, оскільки false приводиться до 0.
// Відповідно true < 1 це 1 < 1 дає false
console.log((+null == false) < 1);

// Операція: false && true || true
// Оператор && має вищий пріоритет, ніж ||, відтак false && true дає false (перше хибне значення)
// далі || перевіряє два значення і повертає перше істинне значення, тобто true
console.log(false && true || true);

// Операція: false && (false || true)
// Оператор || перевіряє два значення і повертає перше істинне значення, тобто true
// Оскільки один із операторів false, то і в результаті false && true буде false
console.log(false && (false || true));

// Операція: (+null == false) < 1 ** 5
// Спочатку в дужках: +null == false дає true (null приводиться до 0, а false також до 0)
// Підносимо до ступеня: 1 ** 5 = 1
// true < 1  повертає true
console.log((+null == false) < 1 ** 5);